{
  "Recipes": [
    {
      "recipeTitle": "Pot Roast",
      "chef": "Sean",
      "familyStory": "One of our first, best, and most often used slow cooker recipes.  You can't mess it up.  It always tastes good.  And it's very simple to prepare.  If you have zero time, just throw all ingredients in the slow cooker and let it go for eight hours.  I think the more onions the better.",
      "ingredients": "2-3lbs beef (chuck is a good choice), 2-3 yellow onions diced, 4 cloves garlic minced, 2-3 carrots peeled and chunked, handful of small potatoes, 1c red wine, 2-3 sprigs fresh rosemary, 2-3 sprigs fresh thyme, 2c beef broth, olive oil, salt, pepper",
      "instructions": "Salt meat, leave out at room temperature.  Sear all sides, set aside.  Fry onions and garlic.  Deglaze with red wine.  Add all ingredients to slow cooker.  Let cook on low for 8-10 hours or high for 4-6 hours.",
      "inspiredBy": "",
      "category": "main",
      "id": 1,
      "likes": 16
    },
    {
      "recipeTitle": "Risotto - Bianco",
      "chef": "Sean",
      "familyStory": "My Aunt Pat used to make a red sauce risotto that I always loved as a kid.  But I never really made it for myself.  Then, in 2018 of 2019, I felt like some risotto.  I Googled around and came across Chef Jaime Oliver's Risotto Blanco recipe.  It has been a hit and a treat ever since.  I don't know that I'll ever go back to a red sauce risotto.",
      "ingredients": "2c Arborrio rice (short grain Italian rice), 1 knob butter (an English term I can never remember, just use 4tbsp), 1 yellow onion diced, 3 cloves garlic minced, 3 sticks celery finely chopped, 1 1/2c dry white wine, 5c chicken stock, 1c frozen peas, 2c grated parmesan, salt, pepper",
      "instructions": "In a medium sauce pan heat chicken stock.  In a large pot, melt butter, lightly sautee onion, garlic, celery into a soffrito.  Turn up heat to medium high, add rice and stir 2 mins.  Add wine, let it absorb.  Slowly add c hicken stock one ladle at a time and let it absord, stirring frequently.  Add peas.  Taste for doneness.  Add cheese.  Add salt and pepper to taste.",
      "inspiredBy": "Chef Jamie Oliver",
      "category": "side",
      "likes": 5,
      "id": 2
    },
    {
      "recipeTitle": "Ropa Vieja",
      "chef": "Sean",
      "familyStory": "We moved our family to Stuttgart, Germany on 20 April 2022.  We were living in a hotel room and had a slow cooker to make meals.  As I was thinking of dinner ideas I remembered Ropa Vieja.  I looked up some recipes and combined the best parts of each and adjusted.  The first time I made it I didn't even realize it was Cinco de Mayo.  Coincidence?",
      "ingredients": "2.5lbs skirt steak or similar, 4 cloves garlic minced, 2 yellow onions diced, 1 green bell pepper in strips, 1/4c fresh cilantro chopped, 1 large can whole peeled tomatoes, 1 can tomato paste, 1/2 bottle green olives chopped, 1c red wine, 2c beef broth, 1/4c lime juice, 1tbsp cumin, 1tbsp ancho chile powder, 2tsp chipotle pepper powder, olive oil, salt, pepper.",
      "instructions": "Salt meat, set out to room temperature.  Sear meat on all sides, set aside.  Heat oil, fry onions, garlic, bell pepper.  Deglaze with wine.  Combine rest of ingredients except olives and simmer to incorporate.  Add everything to slow cooker and cook on medium for 8 hours.  Add olives.  Serve over rice.",
      "inspiredBy": "",
      "category": "main",
      "likes": 5,
      "id": 3
    },
    {
      "recipeTitle": "Fettuccini Alfredo",
      "chef": "Sean",
      "familyStory": "Everybody loves fettuccini alfredo.  I started making this in maybe 2021.  First attempts were just okay, but they got better.  Now, as always, this is one of everyone's favorite side dishes.  We typically have it with a delicious grilled or roasted chicken, and peas and carrots.",
      "ingredients": "1 box fettuccini, 2c heavy cream, 3 cloves garlic minced, 4tbsp butter, 1c parmesan shredded, 1c romano shredded, salt pepper, 1tbsp all-purpose flour",
      "instructions": "Melt 3tbsp butter in a sauce pan, sautee garlic.  Add cream, salt and pepper to taste, bring to a boil, simmer 3-5 mins to reduce (should coat the back of a wooden spoon).  Remove from heat, add parmesan and romano.  In small pan, heat 1tbsp butter, add flour to make a roux.  Add to sauce, put sauce over low heat to incorporate and thicken.  Season to taste.  Add to cooked pasta.  Serve.",
      "inspiredBy": "",
      "category": "side",
      "likes": 5,
      "id": 4
    },
    {
      "recipeTitle": "Thai Red Curry (Pork, Chicken, Beef)",
      "chef": "Sean",
      "familyStory": "We first saw this recipe in 2021.  Chef Gordon Ramsay was posting ten-minute cooking clips on YouTube.  One of them was chicken curry.  We tried it and liked it so much it ended up in the regualar rotation.  I've adapted the ingredients and instructions from various other Thai curry recipes, but I tried to keep it as simple as Chef Ramsay made it.",
      "ingredients": "2lbs pork/chicken/beef, 1 yellow onion diced, 3 cloves garlic minced, 1 can coconut milk, 2tbs red curry paste, 1 can diced tomatos, 1 can tomato paste, 1/4c fresh basil chopped, 1/4c fresh cilantro chopped, olive oil, salt, pepper",
      "instructions": "Cut meat into thin strips; brown in pan with oil, drain, set aside.  In a separate pot, heat oil and brown onion and garlic; add the rest of the ingredients, simmer, adjust to taste.  Add back meat and simmer 10 mins.  Season to taste.  Serve.",
      "inspiredBy": "Chef Gordon Ramsay",
      "category": "main",
      "likes": 4,
      "id": 5
    },
    {
      "recipeTitle": "6",
      "chef": "6",
      "familyStory": "6Family Story... / Description...",
      "ingredients": "6Ingredients...",
      "instructions": "6Instructions...",
      "inspiredBy": "6y",
      "category": "please-select",
      "likes": 0,
      "id": 6
    },
    {
      "recipeTitle": "Cocoa Whipped Cream",
      "chef": "Sean",
      "familyStory": "We were looking for less sugary and a little \"healthier\" dessert.  We had some good cocoa powder and I decided to make some fresh whipped cream and add the cocoa.  It was a hit, and not a lot of added sugar.",
      "ingredients": "1-2 cups heavy cream, 1-2 tbsp sugar, good quality cocoa powder to taste",
      "instructions": "Put the cream and sugar in a mixing bowl or Kitchen Aide and mix with a whisk on medium until the cream thickens.  Add the cocoa to taste.  You can go as heavy or as light as you like.",
      "inspiredBy": "",
      "category": "dessert",
      "likes": 0,
      "id": 7
    }
  ]
}